INSERT INTO roles (role_name)
VALUES ('Администратор'),        -- 1
       ('Технический директор'), -- 2
       ('Программист Java'),     -- 3
       ('Программист React'),    -- 4
       ('HR'); -- 5

INSERT INTO departments (department_name)
VALUES ('Администрация'),       -- 1
       ('BackEnd разработка'),  -- 2
       ('Frontend разработка'), -- 3
       ('HR менеджмент'); -- 4

INSERT INTO users (user_firstName, user_lastName, role_id)
VALUES ('Иван', 'Субботин', 1),      -- 1
       ('Петр', 'Понедельников', 2), -- 2
       ('Игнат', 'Вторников', 3),    -- 3
       ('Иван', 'Середец', 3),       -- 4
       ('Максим', 'Четверкин', 3),   -- 5
       ('Вера', 'Пятницкая', 4),     -- 6
       ('Ольга', 'Воскресенская', 5); -- 7

INSERT INTO users_departments (user_id, department_id)
VALUES (1, 1), -- 1
       (2, 1), -- 2
       (3, 2), -- 3
       (4, 2), -- 4
       (5, 2), -- 5
       (6, 3), -- 6
       (7, 4); -- 7

INSERT INTO phonenumbers (phonenumber_number, user_id)
VALUES ('+1(123)123 1111', 1), -- 1
       ('+1(123)123 2222', 1), -- 2
       ('+1(123)123 3333', 2), -- 3
       ('+1(123)123 4444', 2), -- 4
       ('+1(123)123 5555', 3), -- 5
       ('+1(123)123 6666', 4), -- 6
       ('+1(123)123 7777', 5), -- 7
       ('+1(123)123 8888', 6), -- 8
       ('+1(123)123 9999', 7); -- 9

